
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 2 to change, 2 to destroy.</code></pre>

* Create
  * module.fees-register-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.fees-register-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.fees-register-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.fees-register-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Update
  * azurerm_api_management_subscription.fee_pay_team_fee_register_subscription
  * azurerm_api_management_subscription.liberata_supplier_fee_register_subscription
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_fee_register_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_fee_register_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/e7275ccd-3c77-4a1e-abc1-e7238ca213f3"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.liberata_supplier_fee_register_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "liberata_supplier_fee_register_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/027a013b-1be4-4c13-9888-705b9e0d3982"
        # (10 unchanged attributes hidden)
    }

  # module.fees-register-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "db_monitor_ag-fees-register-postgres-db-v15-prod"
      + resource_group_name = "fees-register-postgres-db-v15-data-prod"
      + short_name          = "db_monitor_a"
      + tags                = {
          + "application"         = "fees-and-payments"
          + "builtFrom"           = "https://github.com/HMCTS/ccfr-fees-register-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "production"
          + "managedBy"           = "Fees/Pay"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.fees-register-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_fees-register-postgres-db-v15-prod"
      + resource_group_name      = "fees-register-postgres-db-v15-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fees-register-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/fees-register-postgres-db-v15-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "builtFrom"           = "https://github.com/HMCTS/ccfr-fees-register-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "production"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.fees-register-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_fees-register-postgres-db-v15-prod"
      + resource_group_name      = "fees-register-postgres-db-v15-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fees-register-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/fees-register-postgres-db-v15-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "builtFrom"           = "https://github.com/HMCTS/ccfr-fees-register-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "production"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.fees-register-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_fees-register-postgres-db-v15-prod"
      + resource_group_name      = "fees-register-postgres-db-v15-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fees-register-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/fees-register-postgres-db-v15-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "builtFrom"           = "https://github.com/HMCTS/ccfr-fees-register-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "production"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/fees-register-postgres-db-v15-prod-read-user-name/5063cfd94dc14bb7ba72c07159cd0c06" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "fees-register-postgres-db-v15-prod-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/fees-register-postgres-db-v15-prod-read-user-name/versions/5063cfd94dc14bb7ba72c07159cd0c06" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/fees-register-postgres-db-v15-prod-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "5063cfd94dc14bb7ba72c07159cd0c06" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/fees-register-postgres-db-v15-prod-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/fees-register-postgres-db-v15-prod-read-user-password/ed8413704d674c01b01254e67661f5f1" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "fees-register-postgres-db-v15-prod-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/fees-register-postgres-db-v15-prod-read-user-password/versions/ed8413704d674c01b01254e67661f5f1" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/fees-register-postgres-db-v15-prod-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "ed8413704d674c01b01254e67661f5f1" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/fees-register-postgres-db-v15-prod-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":623,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->